# Reset Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
KeyBasedTreeEntriesIterator..::..Reset Method
KeyBasedTreeEntriesIterator Class See Also
---
Resets the iterator to the initial state.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public virtual void Reset()
```

Visual Basic
---
```text
Public Overridable Sub Reset
```

Visual C++
---
```text
public:
virtual void Reset()
```

# See Also
KeyBasedTreeEntriesIterator Class
Autodesk.Revit.DB Namespace